// Description: This query was originally published on Twitter, by @MsftSecIntel.
// The query helps detect emails associated with a campaign that has used open redirector URLs. The campaign's URLs begin with the distinct pattern, hxxps://t. Attackers use URL redirection to manipulate users into visiting a malicious website or to evade detection.
// Reference - https://twitter.com/MsftSecIntel
// Required Connectors: MicrosoftThreatProtection (Types: EmailUrlInfo)

EmailUrlInfo
| where Url matches regex @"s?\:\/\/(?:www\.)?t\.(?:[\w\-\.]+\/+)+(?:r|redirect)\/?\?"