// Description: This query helps reviewing admin reported email submissions
// Required Connectors: MicrosoftThreatProtection (Types: CloudAppEvents)

CloudAppEvents 
| where Timestamp > ago(30d) 
| extend Record= (parse_json(RawEventData)).RecordType 
| extend SubmissionState = (parse_json(RawEventData)).SubmissionState  
| where Record == 29 
| where ActionType == "AdminSubmission"