// Description: This query helps in checking for spoofing attempts on the domain with Authentication failures
// Required Connectors: MicrosoftThreatProtection (Types: EmailEvents)

EmailEvents 
| where Timestamp > ago (1d) and DetectionMethods contains "spoof"  
| project Timestamp, AR=parse_json(AuthenticationDetails) , NetworkMessageId, EmailDirection, Subject, SenderFromAddress, SenderIPv4,ThreatTypes, DetectionMethods, ThreatNames  
| evaluate bag_unpack(AR)  
| where SPF == "fail" or DMARC == "fail" or DKIM == "fail" or CompAuth == "fail"