// Title: Linux Base64 Encoded Pipe to Shell
// Author: pH-T (Nextron Systems)
// Date: 2022-07-26
// Level: medium
// Description: Detects suspicious process command line that uses base64 encoded input for execution with a shell
// Tags: attack.defense-evasion, attack.t1140
// ================================================================== 

DeviceProcessEvents
| where ProcessCommandLine contains "base64 " and ((ProcessCommandLine contains "| bash " or ProcessCommandLine contains "| sh " or ProcessCommandLine contains "|bash " or ProcessCommandLine contains "|sh ") or (ProcessCommandLine endswith " |sh" or ProcessCommandLine endswith "| bash" or ProcessCommandLine endswith "| sh" or ProcessCommandLine endswith "|bash"))