// Description: // Author: jan geisbauer
// // @janvonkirchheim
// // ------------------------
// // 1.	A list of all devices that have this vulnerability
// // 2.	A list of all users that uses those devices
// // 3.	If these users received .mkv files recently
// Required Connectors: MicrosoftThreatProtection (Types: DeviceTvmSoftwareVulnerabilities, DeviceFileEvents)

// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// If these users opened those .mkv files
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
DeviceFileEvents 
| where DeviceName  in (all_computers_with_vlcvln)
| where FileName contains "mkv"