// Title: Credentials In Files - Linux
// Author: Igor Fits, oscd.community
// Date: 2020-10-15
// Level: high
// Description: Detecting attempts to extract passwords with grepThe SecurityEvent table in Microsoft Sentinel contains security-related events from various sources, including audit logs. To have Linux audit logs available in this table, ensure that the Linux machines are onboarded to Sentinel and sending audit logs to Azure Monitor Logs.
// Tags: attack.credential-access, attack.t1552.001
// ================================================================== 

SecurityEvent
| where type =~ "EXECVE" and ("grep" and "password")