// Description: This query looks for Entra ID role adds identified by Microsoft Defender for Cloud Apps. It will require an corresponding app connector in Microsoft Defender for Cloud Apps.
// Required Connectors: MicrosoftThreatProtection (Types: CloudAppEvents)

let LookBack = 7d; CloudAppEvents | where ActionType in ("Add member to role.") and Timestamp > ago(LookBack) | extend FirstElement = ActivityObjects[0], SecondElement = ActivityObjects[1], ThirdElement = ActivityObjects[2] | extend Type = FirstElement.ServiceObjectType | extend RoleName = FirstElement.Name | extend UserAddedName = SecondElement.Name  | extend UserAddedObjectId = SecondElement.Id | project Timestamp,Type,ActionType,RoleName,UserAddedName,UserAddedObjectId,PerformedByObjectId = AccountId,PerformedByDisplayName