// Description: 'This query looks for Microsoft Defender Antivirus detections with the family names used by KNOTWEED'
// Required Connectors: MicrosoftDefenderAdvancedThreatProtection (Types: SecurityAlert (MDATP))

// AV Detections
let knotweed_sigs = dynamic(["JumplumpDropper", "Jumplump", "Corelump", "Mexlib", "Medcerc ", "SuspModuleLoad"]);
AlertEvidence
| where Timestamp > ago(30d)
| where ThreatFamily in~ (knotweed_sigs)
| join MtpAlerts on AlertId
| project OriginalReportOccurrenceTime, LastSeen, MachineId1, ThreatFamily, AlertId