// Description: Prior to deploying Macaw ransomware in an organization, adversaries will change the password for hundreds or thousands of accounts in order to lock users out of the network and impeded recovery efforts.
// Required Connectors: MicrosoftThreatProtection (Types: DeviceProcessEvents)

DeviceProcessEvents 
| where ProcessCommandLine has_all('user', '/Domain', '/Active:Yes', '/PasswordChg:No') 
| summarize commands=count() by DeviceId, bin(Timestamp, 1d)  
| where commands > 200