// Description: 'Shows all users tagged as VIP in the VIP users watchlist that had anomalies with a score greater than 0.'
// Required Connectors: BehaviorAnalytics (Types: BehaviorAnalytics)

BehaviorAnalytics
| where UsersInsights.IsVIPUser == True
| where InvestigationPriority > 0
| extend AadUserId = UsersInsights.AccountObjectID