// Description: 'The query detects authentication attempts from a decoy user account. 
// A decoy user account is explicitly created and monitored to alert the SOC, indicating a malicious activity when the account is in use.'
// Required Connectors: SecurityEvents (Types: SecurityEvent); WindowsSecurityEvents (Types: SecurityEvent)

// Enter a reference list of decoy users (usernames) "Case Sensitive"
   let DecoyUserNameList = dynamic (["DecoyUser1","DecoyUser2"]);
SecurityEvent
 | where TargetUserName in (DecoyUserNameList)
 | where EventID in (4624,4625)
 | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, TargetUserName, LogonTypeName, IpAddress
 | extend Account_0_Name = TargetUserName
 | extend Host_0_HostName = Computer
 | extend IP_0_Address = IpAddress