// Description: 'Shows login activity (successful or failed) originated from botnet, Tor proxy or C2, with at least one 'True' activity insight.'
// Required Connectors: BehaviorAnalytics (Types: BehaviorAnalytics)

BehaviorAnalytics
| where ActivityType =~ 'LogOn' or ActivityType =~ 'FailedLogOn'
| where DevicesInsights.ThreatIntelIndicatorType =~ 'Botnet' 
  or DevicesInsights.ThreatIntelIndicatorType =~ 'C2' 
  or DevicesInsights.ThreatIntelIndicatorType =~ 'Proxy'
| where ActivityInsights contains 'True'
| extend AadUserId = UsersInsights.AccountObjectID
| extend Account_0_AadUserId = AadUserId