// Description: 'This query detects all authentication attempts of non administrator accounts that their RID is ending in *-500.
// Ref: https://stealthbits.com/blog/rid-hijacking-when-guests-become-admins/'
// Required Connectors: SecurityEvents (Types: SecurityEvent)

// Enter a reference list of default local administrators for your Windows systems
let LocalAdminsList = dynamic (["administrator","admin"]);
SecurityEvent
| where EventID in (4624,4625) and TargetUserSid endswith "-500" and TargetUserName !in (LocalAdminsList)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Computer, TargetUserName, TargetUserSid, TargetLogonId, IpAddress, LogonTypeName