// Title: Potential Registry Reconnaissance Via PowerShell Script
// Author: frack113
// Date: 2023-07-02
// Level: medium
// Description: Detects PowerShell scripts with potential registry reconnaissance capabilities. Adversaries may interact with the Windows registry to gather information about the system credentials, configuration, and installed software.This table contains Windows security event logs, which may include information about script block logging being enabled. Ensure that the Windows Security Events data connector is enabled in Sentinel to query this table.
// Tags: attack.discovery, attack.t1012, attack.t1007, detection.threat-hunting
// ================================================================== 

SecurityEvent
| where ScriptBlockText matches regex "(Get-Item|gci|Get-ChildItem).{1,64}-Path.{1,64}\\\\(currentcontrolset\\\\services|CurrentVersion\\\\Policies\\\\Explorer\\\\Run|CurrentVersion\\\\Run|CurrentVersion\\\\ShellServiceObjectDelayLoad|CurrentVersion\\\\Windows\\winlogon)\\\\"