// Title: End User Consent
// Author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
// Date: 2022-07-28
// Level: low
// Description: Detects when an end user consents to an applicationThis table contains Azure audit logs. Ensure that Azure Monitor logs are enabled and the necessary connectors are set up in Microsoft Sentinel to collect Azure activity logs.
// Tags: attack.credential-access, attack.t1528
// ================================================================== 

AzureActivity
| where 'ConsentContext.IsAdminConsent' =~ "false"