// Description: This query finds anomalous models discovered
// Required Connectors: MicrosoftThreatProtection (Types: DeviceInfo)

// 
let AnomalousModelCount = 5;
DeviceInfo
| summarize arg_max(Timestamp, *) by DeviceId
| summarize ModelAppearanceCount=dcount(DeviceId) by Model
| where ModelAppearanceCount < AnomalousModelCount