// Description: This query surfaces devices that are in a specific IPAddressV6 subnet
// Required Connectors: MicrosoftThreatProtection (Types: DeviceInfo)

// Specify the relevant subnet in IpV6Range
let IpV6Range = "2001:4898::1050:1050/127";
DeviceNetworkInfo
| summarize arg_max(Timestamp, *) by DeviceId
| mv-expand IPAddressEntry=todynamic(IPAddresses)
| extend IPAddress=tostring(IPAddressEntry.IPAddress)
| where ipv6_is_match(IPAddress, IpV6Range)