// Description: This query provides the most common services discovered
// Required Connectors: MicrosoftThreatProtection (Types: DeviceTvmSoftwareVulnerabilities)

//
DeviceTvmSoftwareVulnerabilities 
| where ingestion_time() > ago(7d)
| summarize arg_max(DeviceId, *) by SoftwareVendor, SoftwareName
| summarize DiscoveredOnDevicesCount = dcount(DeviceId) by SoftwareVendor, SoftwareName