// Description: This query searches for not onboarded devices with a specific Suffix
// Required Connectors: MicrosoftThreatProtection (Types: DeviceInfo)

//
let Onboarded = "Onboarded";
let DeviceNameSuffix = "-pc";
DeviceInfo
| summarize arg_max(Timestamp, *) by DeviceId
| where OnboardingStatus != "Onboarded"
| where DeviceName endswith DeviceNameSuffix