// Description: Query 1 shows you any network communication happened from endpoints to a specific Remote IP or Remote URL.
// Ensure to update RemoteIP and RemoteURL variable.
// For questions @MiladMSFT on Twitter or milad.aslaner@microsoft.com by email.
// Required Connectors: MicrosoftThreatProtection (Types: DeviceFileEvents)

// Query 4 Search for specific network communication of a Remote IP or URL that also discovers related file creation events
// Ensure to update RemoteIP and RemoteURL variable.
DeviceFileEvents
| where FileOriginUrl == "IP ADDRESS GOES HERE" or FileOriginUrl contains "URL GOES HERE" or FileOriginReferrerUrl contains "URL GOES HERE"
| project DeviceName, Timestamp, FileName, FileOriginUrl, FileOriginIP, FileOriginReferrerUrl, SHA1