// Description: Detect if someone run netsh and try to expose WPA keys in clear text
// @mattiasborg82.
// Blog.sec-labs.com.
// Required Connectors: MicrosoftThreatProtection (Types: DeviceProcessEvents)

DeviceProcessEvents 
| where Timestamp > ago(7d)
| where ProcessCommandLine startswith "netsh"
| where ProcessCommandLine has "key=clear"
| project Timestamp, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine
| top 100 by Timestamp