// Title: Potentially Suspicious GrantedAccess Flags On LSASS
// Author: Florian Roth, Roberto Rodriguez, Dimitrios Slamaris, Mark Russinovich, Thomas Patzke, Teymur Kheirkhabarov, Sherif Eldeeb, James Dickenson, Aleksey Potapov, oscd.community
// Date: 2021-11-22
// Level: medium
// Description: Detects process access requests to LSASS process with potentially suspicious access flagsThe SecurityEvent table in Microsoft Sentinel contains Windows security event logs, which would include process access events. Ensure that the Windows Security Events data connector is enabled in Sentinel to have access to this table.
// Tags: attack.credential-access, attack.t1003.001, attack.s0002
// ================================================================== 

SecurityEvent
| where (((GrantedAccess endswith "30" or GrantedAccess endswith "50" or GrantedAccess endswith "70" or GrantedAccess endswith "90" or GrantedAccess endswith "B0" or GrantedAccess endswith "D0" or GrantedAccess endswith "F0" or GrantedAccess endswith "18" or GrantedAccess endswith "38" or GrantedAccess endswith "58" or GrantedAccess endswith "78" or GrantedAccess endswith "98" or GrantedAccess endswith "B8" or GrantedAccess endswith "D8" or GrantedAccess endswith "F8" or GrantedAccess endswith "1A" or GrantedAccess endswith "3A" or GrantedAccess endswith "5A" or GrantedAccess endswith "7A" or GrantedAccess endswith "9A" or GrantedAccess endswith "BA" or GrantedAccess endswith "DA" or GrantedAccess endswith "FA" or GrantedAccess endswith "0x14C2") or (GrantedAccess startswith "0x100000" or GrantedAccess startswith "0x1418" or GrantedAccess startswith "0x1438" or GrantedAccess startswith "0x143a" or GrantedAccess startswith "0x1f0fff" or GrantedAccess startswith "0x1f1fff" or GrantedAccess startswith "0x1f2fff" or GrantedAccess startswith "0x1f3fff" or GrantedAccess startswith "0x40")) and TargetImage endswith "\\lsass.exe") and (not(((GrantedAccess =~ "0x401" and InitiatingProcessFolderPath endswith "\\explorer.exe") or (InitiatingProcessFolderPath contains ":\\Program Files (x86)\\" or InitiatingProcessFolderPath contains ":\\Program Files\\" or InitiatingProcessFolderPath contains ":\\Windows\\System32\\" or InitiatingProcessFolderPath contains ":\\Windows\\SysWOW64\\") or (InitiatingProcessFolderPath contains ":\\ProgramData\\Microsoft\\Windows Defender\\" and InitiatingProcessFolderPath endswith "\\MsMpEng.exe") or (((CallTrace contains "|" and CallTrace contains ":\\ProgramData\\Microsoft\\Windows Defender\\Definition Updates\\{") and CallTrace contains "}\\mpengine.dll+") and GrantedAccess =~ "0x1418") or (CallTrace contains "|c:\\program files\\windows defender\\mprtp.dll" or CallTrace contains "|c:\\program files\\windows defender\\MpClient.dll")))) and (not((InitiatingProcessFolderPath endswith ":\\ProgramData\\MALWAREBYTES\\MBAMSERVICE\\ctlrupdate\\mbupdatr.exe" or (GrantedAccess =~ "0x40" and InitiatingProcessFolderPath endswith "\\MBAMInstallerService.exe") or (GrantedAccess =~ "0x40" and (InitiatingProcessFolderPath endswith "\\aurora-agent-64.exe" or InitiatingProcessFolderPath endswith "\\aurora-agent.exe" or InitiatingProcessFolderPath endswith "\\thor.exe" or InitiatingProcessFolderPath endswith "\\thor64.exe")) or InitiatingProcessFolderPath contains "\\SteamLibrary\\steamapps\\" or (GrantedAccess =~ "0x40" and (InitiatingProcessFolderPath endswith "\\handle.exe" or InitiatingProcessFolderPath endswith "\\handle64.exe")) or (GrantedAccess =~ "0x40" and (InitiatingProcessFolderPath endswith "\\PROCEXP64.EXE" or InitiatingProcessFolderPath endswith "\\PROCEXP.EXE")) or (InitiatingProcessFolderPath contains ":\\ProgramData\\VMware\\VMware Tools\\" and InitiatingProcessFolderPath endswith "\\vmtoolsd.exe") or InitiatingProcessFolderPath endswith "\\AppData\\Local\\Programs\\Microsoft VS Code\\Code.exe" or (GrantedAccess =~ "0x401" and InitiatingProcessFolderPath endswith "\\AppData\\Local\\WebEx\\WebexHost.exe"))))