// Description: This query provides insights on the detections done by Safe Attachment detections
// Required Connectors: MicrosoftThreatProtection (Types: EmailEvents)

EmailEvents
| where DetectionMethods != "" 
| extend detection= tostring(parse_json(DetectionMethods).Phish) 
| where detection has "File detonation reputation" or detection has "File detonation"
| summarize total=count() by bin(Timestamp, 1d) 
| order by Timestamp asc