// Title: Powershell Token Obfuscation - Process Creation
// Author: frack113
// Date: 2022-12-27
// Level: high
// Description: Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation
// Tags: attack.defense-evasion, attack.t1027.009
// ================================================================== 

DeviceProcessEvents
| where (ProcessCommandLine matches regex "\\w+`(\\w+|-|.)`[\\w+|\\s]" or ProcessCommandLine matches regex ""(\\{\\d\\})+"\\s*-f" or ProcessCommandLine matches regex "(?i)\\$\\{`?e`?n`?v`?:`?p`?a`?t`?h`?\\}") and (not(ProcessCommandLine contains "${env:path}"))