// Description: This query helps reviewing URL click count by ClickAction
// Required Connectors: MicrosoftThreatProtection (Types: UrlClickEvents)

UrlClickEvents 
| extend UrlBlocked = ActionType has_any("ClickBlocked") 
| extend UrlAllowed = ActionType has_any('ClickAllowed') 
| extend UrlPendingVerdict = ActionType has_any('UrlScanInProgress') 
| extend ErrorPage = ActionType has_any('UrlErrorPage') 
| summarize Blocked = countif(UrlBlocked), Allowed = countif(UrlAllowed), PendingVerdict = countif(UrlPendingVerdict), Error = countif(ErrorPage), ClickedThrough = countif(IsClickedThrough)