// Description: Microsoft has observed Bazacall using Cobalt Strike in order to move laterally to other machines on the network.
// Required Connectors: MicrosoftThreatProtection (Types: AlertInfo, AlertEvidence)

AlertInfo
| where Title in("File dropped and launched from remote location", "Suspicious transfer of an executable file")
// Joining in instances where Cobalt Strike's built-in PsExec is used for lateral movement
| join AlertEvidence on $left.AlertId == $right.AlertId
| where FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}"