// Title: Linux Shell Pipe to Shell
// Author: Florian Roth (Nextron Systems)
// Date: 2022-03-14
// Level: medium
// Description: Detects suspicious process command line that starts with a shell that executes something and finally gets piped into another shell
// Tags: attack.defense-evasion, attack.t1140
// ================================================================== 

DeviceProcessEvents
| where (ProcessCommandLine startswith "sh -c " or ProcessCommandLine startswith "bash -c ") and ((ProcessCommandLine contains "| bash " or ProcessCommandLine contains "| sh " or ProcessCommandLine contains "|bash " or ProcessCommandLine contains "|sh ") or (ProcessCommandLine endswith "| bash" or ProcessCommandLine endswith "| sh" or ProcessCommandLine endswith "|bash" or ProcessCommandLine endswith " |sh"))