// Description: This query helps reviewing count of users attacked more than x times average.
// Required Connectors: MicrosoftThreatProtection (Types: EmailEvents)

let AverageThreatPerRecipient = toscalar(EmailEvents 
| where DetectionMethods != "" 
| summarize total=count() by RecipientEmailAddress 
| summarize avg(total)); 
EmailEvents 
| where DetectionMethods != "" 
| summarize total=count() by RecipientEmailAddress 
| where tolong(total) >= 1*AverageThreatPerRecipient // update "1"