// Description: This query helps reviewing external top malicious email sender with malware or phishing emails in an organization in last 30 days
// Required Connectors: MicrosoftThreatProtection (Types: EmailEvents)

EmailEvents 
| where Timestamp > ago(30d) 
| where EmailDirection == "Inbound" 
| summarize count() by SenderFromAddress 
| sort by count_