// Description: This query helps reviewing top targeted users with malware or phishing emails in an organization in last 30 days
// Required Connectors: MicrosoftThreatProtection (Types: EmailEvents)

EmailEvents 
| where Timestamp > ago(30d) 
| where ThreatTypes has "Malware" or ThreatTypes has "Phish" 
| summarize count() by RecipientEmailAddress 
| sort by count_