// Title: Linux Package Uninstall
// Author: Tuan Le (NCSGroup), Nasreddine Bencherchali (Nextron Systems)
// Date: 2023-03-09
// Level: low
// Description: Detects linux package removal using builtin tools such as "yum", "apt", "apt-get" or "dpkg".
// Tags: attack.defense-evasion, attack.t1070
// ================================================================== 

DeviceProcessEvents
| where ((ProcessCommandLine contains "remove" or ProcessCommandLine contains "purge") and (FolderPath endswith "/apt" or FolderPath endswith "/apt-get")) or ((ProcessCommandLine contains "--remove " or ProcessCommandLine contains " -r ") and FolderPath endswith "/dpkg") or (ProcessCommandLine contains " -e " and FolderPath endswith "/rpm") or ((ProcessCommandLine contains "erase" or ProcessCommandLine contains "remove") and FolderPath endswith "/yum")