// Description: This rule detects when the ASR rule AsrRansomwareBlocked or AsrRansomwareAudited is triggered.
// No alert is generated by default. This could be the start of a ransomware attack. 
// Additional information available by Microsoft: 
// https://docs.microsoft.com/microsoft-365/security/defender-endpoint/attack-surface-reduction-rules-reference?view=o365-worldwide#use-advanced-protection-against-ransomware
// Required Connectors: MicrosoftThreatProtection (Types: DeviceEvents)

DeviceEvents
| where Timestamp > ago(30d)
| where ActionType has_any ('AsrRansomwareBlocked', 'AsrRansomwareAudited')
| summarize arg_max(Timestamp, *), TotalEvents = count(), TriggeredFiles = make_set(FileName),FileHashes = make_set(SHA1),
IntiatingProcesses = make_set(InitiatingProcessCommandLine) by DeviceName, AccountName
| project Timestamp, DeviceName, AccountDomain, AccountName, TotalEvents, TriggeredFiles, FileHashes, IntiatingProcesses