// Description: This query checks for alerts related to file drop and remote execution where the file name matches PsExec and similar tools used for distribution
// Required Connectors: MicrosoftThreatProtection (Types: AlertInfo, AlertEvidence)

AlertInfo
| where Title == "File dropped and launched from remote location"
| join AlertEvidence on $left.AlertId == $right.AlertId
// Looking for tools involved in potential distribution of ransomware
| where FileName hasprefix "psexe" or (FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}")
or ProcessCommandLine has "accepteula"