// Description: Use this query to locate emails with subject indicators of a reply or forward, and the attachment is a .doc, or a .zip containing a .doc. Review results for suspicious emails.
// IcedId can lead to ransomware
// Required Connectors: MicrosoftThreatProtection (Types: EmailEvents, EmailAttachmentInfo)

// Identify a reply or forward via subject line 
let SubjectTerms = pack_array("RE:","FW:","FWD:","AW:","WG:"); 
EmailEvents 
| where Subject has_any(SubjectTerms) 
| where EmailDirection == "Inbound" // Join on those emails by file type (doc or zip>doc) 
| join EmailAttachmentInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where AttachmentCount == 1 
| where FileType has 'WordStorage' or FileType has 'WordStorage;Zip'