// Description: This query checks for attempts to stop at least 10 separate processes using the net stop command. Run query
// Required Connectors: MicrosoftThreatProtection (Types: DeviceProcessEvents)

// Find attempts to stop processes using net stop
DeviceProcessEvents
| where Timestamp > ago(1d)
| where FileName =~ "net.exe" and ProcessCommandLine has "stop"
| summarize netStopCount = dcount(ProcessCommandLine), NetStopList = make_set(ProcessCommandLine) by DeviceId, bin(Timestamp, 2m)
| where netStopCount > 10