// Description: This query checks for attempts to stop at least 10 separate processes using the taskkill.exe utility. Run query
// Required Connectors: MicrosoftThreatProtection (Types: DeviceProcessEvents)

// Find attempts to stop processes using taskkill.exe
DeviceProcessEvents
| where Timestamp > ago(1d)
| where FileName =~ "taskkill.exe" 
| summarize taskKillCount = dcount(ProcessCommandLine), TaskKillList = make_set(ProcessCommandLine) by DeviceId, bin(Timestamp, 2m)
| where taskKillCount > 10