// Title: Invoke-Obfuscation Via Use Clip - Security
// Author: Nikita Nazarov, oscd.community
// Date: 2020-10-09
// Level: high
// Description: Detects Obfuscated Powershell via use Clip.exe in ScriptsThis table contains security-related events, including event ID 4697. Ensure that the Windows Security Events data connector is enabled in Microsoft Sentinel to have access to this table.
// Tags: attack.defense-evasion, attack.t1027, attack.execution, attack.t1059.001
// ================================================================== 

SecurityEvent
| where ServiceFileName contains "(Clipboard|i"