// Title: Invoke-Obfuscation Via Stdin - Powershell
// Author: Nikita Nazarov, oscd.community
// Date: 2020-10-12
// Level: high
// Description: Detects Obfuscated Powershell via Stdin in ScriptsThe SecurityEvent table in Microsoft Sentinel contains Windows security event logs, which would include logs related to PowerShell script execution. Ensure that the Windows Security Events data connector is enabled in Sentinel to have access to this table.
// Tags: attack.defense-evasion, attack.t1027, attack.execution, attack.t1059.001
// ================================================================== 

SecurityEvent
| where ScriptBlockText matches regex "(?i)(set).*&&\\s?set.*(environment|invoke|\\$\\{?input).*&&.*""