// Title: Invoke-Obfuscation Via Use Clip - Powershell
// Author: Nikita Nazarov, oscd.community
// Date: 2020-10-09
// Level: high
// Description: Detects Obfuscated Powershell via use Clip.exe in ScriptsThis table contains Windows security event logs, which may include logs related to PowerShell script execution. Ensure that the Windows Security Events data connector is enabled in Microsoft Sentinel to query this table.
// Tags: attack.defense-evasion, attack.t1027, attack.execution, attack.t1059.001
// ================================================================== 

SecurityEvent
| where ScriptBlockText matches regex "(?i)echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?)"