// Title: UAC Bypass Using Event Viewer RecentViews
// Author: Nasreddine Bencherchali (Nextron Systems)
// Date: 2022-11-22
// Level: high
// Description: Detects the pattern of UAC Bypass using Event Viewer RecentViews
// Tags: attack.defense-evasion, attack.privilege-escalation
// ================================================================== 

DeviceProcessEvents
| where (ProcessCommandLine contains "\\Event Viewer\\RecentViews" or ProcessCommandLine contains "\\EventV~1\\RecentViews") and ProcessCommandLine contains ">"